// #include<stdio.h>
// int main()
// {
//     int n;
//     scanf("%d",&n);
//     int a[n];
//     for(int i=0;i<n;i++)
//     {
//         scanf("%d",&a[i]);  // এরে ইনপুট নেওয়া হচ্ছে।
//     }
//     int zero=0,one=0,two=0;  // জিরো, ওয়ান, টু কাউন্ট করার জন্য তিনটি ভেরিয়েবল নেওয়া হয়েছে।
//     for(int i=0;i<n;i++)     // লুপ চালিয়ে সম্পূর্ণ এরে ট্রাভারস করা হচ্ছে।
//     {
//         if(a[i]==0)          // চেক করা হচ্ছে এরের এলিমেন্টটি জিরো কিনা।
//             zero++;          // যদি জিরো হয় তাহলে জিরো ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে।
//         if(a[i]==1)          // চেক করা হচ্ছে এরের এলিমেন্টটি ওয়ান কিনা।
//             one++;           // যদি ওয়ান হয় তাহলে ওয়ান ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে। 
//         if(a[i]==2)          // চেক করা হচ্ছে এরের এলিমেন্টটি টু কিনা।
//             two++;           // যদি টু হয় তাহলে টু ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে। 
//     }
//     printf("O -> %d\n",zero);   // প্রিন্ট করা হচ্ছে 0,1,2 কতবার করে আছে।
//     printf("1 -> %d\n",one);
//     printf("2 -> %d\n",two);
//     return 0;
// }

#include<stdio.h>
int main()
{
    int n;
    scanf("%d",&n);
    int a[n];
    for(int i=0;i<n;i++)
    {
        scanf("%d",&a[i]);   
    }
    int cnt[10]={0};
    for(int i=0;i<n;i++)    
    {
        cnt[a[i]]++; 
    }
    
    for(int i=0;i<=9;i++) 
    {
        printf("%d - %d\n",i,cnt[i]);
    }
    return 0;
}