#include<stdio.h>
int main()
{
    char a[100], b[100];
    scanf("%s %s",a,b);
     int i=0;
    while(1)
    {   
         if(a[i]=='\0'&& b[i]=='\0')
        {
            printf("Same\n");
            break;
        }
        else if(a[i]=='\0')
        {
            printf("A choto\n");
            break;
        }
        else if (b[i]=='\0')
        {
            printf("B choto\n");
            break;
        }
        if(a[i]=b[i])
        {
            i++;
        }
        else if(a[i]<b[i])
        {
            printf("A choto\n");
            break;
        }
        else
        {
            printf("B choto\n");
            break;
        }
    }
    return 0;
}
// #include<stdio.h>
// int main()
// {
//     char a[100],b[100];
//     scanf("%s %s",a,b);    // দুটি স্ট্রিং ইনপুট নেওয়া হচ্ছে
//     int i=0;
//     while(1)        // এখানে আমাদের লুপ থামিয়ে দেওয়ার অনেকগুলো কন্ডিশন আছে। সবগুলো কন্ডিশন শুরুতে লিখে ফেলাটা ভালো দেখাবে না তাই এখানে আমরা ইনফাইনাইট লুপ চালাচ্ছি। লুপের ভিতর যখনি থেমে যাওয়ার কন্ডিশন মিলে যাবে তখন আমরা ব্রেক করে লুপ থামিয়ে দিব।
//     {
//         if(a[i]=='\0' && b[i]=='\0')   // প্রথমেই চেক করছি দুটো স্ট্রিং ই শেষ কিনা অর্থাৎ আমরা দুটো স্ট্রিং এর ই নালে চলে আসছি কিনা।
//         {
//             printf("Same\n");       // যদি দুটো স্ট্রিং ই শেষ হয়ে যায় তাহলে দুটো স্ট্রিং ই সেইম।
//             break;                  // ব্রেক করে লুপ থামিয়ে দেওয়া হচ্ছে।
//         }
//         else if(a[i]=='\0')        // উপরের কন্ডিশনটি সত্য হয় নি তাই এবার আমরা চেক করছি শুধু প্রথম স্ট্রিংটি শেষ হয়েছে কিনা
//         {
//             printf("A choto\n");    // যদি প্রথম স্ট্রিংটি শেষ হয়ে থাকে তাহলে এটিই ছোট।
//             break;                 // ব্রেক করে লুপ থামিয়ে দেওয়া হচ্ছে।
//         }
//         else if(b[i]=='\0')        // উপরের দুটো কন্ডিশনটি সত্য হয় নি তাই এবার আমরা চেক করছি শুধু দ্বিতীয় স্ট্রিংটি শেষ হয়েছে কিনা
//         {
//             printf("B choto\n");   // যদি দ্বিতীয় স্ট্রিংটি শেষ হয়ে থাকে তাহলে এটিই ছোট।
//             break;                 // ব্রেক করে লুপ থামিয়ে দেওয়া হচ্ছে।
//         } 

//         // উপরের তিনটি কন্ডিশনের কোনটিই যদি সত্য না হয়ে থাকে তাহলে বুঝা যাচ্ছে কোন স্ট্রিং ই শেষ হয়ে যায় নি। এবার আমাদের মিল অমিল চেক করতে হবে তাই নতুন একটি ইফ এলস লেডার চালানো হচ্ছে।

//         if(a[i]==b[i])     // প্রথমেই চেক করে নিচ্ছি দুটো স্ট্রিং এর ক্যারেক্টার সেইম কিনা।
//         {
//             i++;           // সেইম হলে আমরা লুপ কন্টিনিউ করব। তাই i এর মান বাড়িয়ে দিচ্ছি।
//         }        
//         else if(a[i]<b[i])   // যদি উপরের কন্ডিশন সত্য না হয় তারমানে অমিল পাওয়া গেছে। এবার দেখছি প্রথম স্ট্রিং এর ক্যারেক্টারটি ছোট কিনা।
//         {
//             printf("A choto\n");   // যদি ছোট হয় তাহলে প্রিন্ট করে দিচ্ছি প্রথম স্ট্রিংটি ছোট।
//             break;               // ব্রেক করে লুপ থামিয়ে দেওয়া হচ্ছে।
//         }
//         else            // যদি উপরের কন্ডিশন সত্য না হয় তারমানে অবশ্যই দ্বিতীয় স্ট্রিং এর ক্যারেক্টারটি ছোট।
//         {
//             printf("B choto\n");    // তাই প্রিন্ট করে দিচ্ছি দ্বিতীয়টি ছোট।
//             break;                  // ব্রেক করে লুপ থামিয়ে দেওয়া হচ্ছে।
//         }
//     }
//     return 0;
// }

