#include<stdio.h>
int main()
{
    char a[1000001];
    fgets(a,1000001,stdin);
    for(int i=0;a[i]!='\\';i++)
    {
         printf("%c",a[i]);
    }
    return 0;
}


// #include<stdio.h>
// int main()
// {
//     char a[1000001];
//     fgets(a,1000001,stdin);  // স্পেস সহ ইনপুট নিচ্ছি
//     for(int i=0;a[i] != '\\';i++)   // লুপ চালাচ্ছি স্ট্রিং এর শুর থেকে। লুপ থামিয়ে দিব যখন আমরা স্ট্রিং এর মধ্যে \ এই ক্যারেক্টারটি পাব। সি প্রোগ্রামিং এ \ এটি বুঝানোর জন্য '\\' এভাবে লিখতে হয়।
//     { 
//         printf("%c",a[i]);    // প্রতিবার ক্যারেক্টার প্রিন্ট হচ্ছে। লুপ থামলে প্রিন্ট করা থেমে যাবে।
//     }
//     return 0;
// }
